In [133]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import datasets  
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.tree import  DecisionTreeClassifier
from sklearn import tree
from sklearn.metrics import classification_report
from sklearn import preprocessing

In [134]:
data = pd.read_csv("Fraud_check.csv")
data

,Undergrad,MaritalStatus,TaxableIncome,CityPopulation,WorkExperience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES
596,YES,Divorced,69967,55369,2,YES
597,NO,Divorced,47334,154058,0,YES
598,YES,Married,98592,180083,17,NO
599,NO,Divorced,96519,158137,16,NO

In [135]:
#covert into numeric
labelencoder = preprocessing.LabelEncoder()
data['Undergrad'] = labelencoder.fit_transform(data['Undergrad'])
data['MaritalStatus'] = labelencoder.fit_transform(data['MaritalStatus'])
data['Urban'] = labelencoder.fit_transform(data['Urban'])

In [136]:
data

,Undergrad,MaritalStatus,TaxableIncome,CityPopulation,WorkExperience,Urban
0,0,2,68833,50047,10,1
1,1,0,33700,134075,18,1
2,0,1,36925,160205,30,1
3,1,2,50190,193264,15,1
4,0,1,81002,27533,28,0
...,...,...,...,...,...,...
595,1,0,76340,39492,7,1
596,1,0,69967,55369,2,1
597,0,0,47334,154058,0,1
598,1,1,98592,180083,17,0
599,0,0,96519,158137,16,0

In [137]:
# so in udergrad  and urban ; 0 =no & 1= yes
#in martial status 0 = married , 1 = divorced and 2 = single

In [138]:
data.isnull().sum()
#good the data doesnt have null values and all are same type int

Undergrad         0
MaritalStatus     0
TaxableIncome     0
CityPopulation    0
WorkExperience    0
Urban             0
dtype: int64

In [139]:
good= data[data.TaxableIncome < 30000]
good

,Undergrad,MaritalStatus,TaxableIncome,CityPopulation,WorkExperience,Urban
10,0,2,29732,102602,19,1
12,0,0,11794,148033,14,1
16,1,0,24987,34551,29,0
19,0,2,10987,126953,30,1
21,1,0,14310,29106,7,1
...,...,...,...,...,...,...
544,0,2,29916,133877,21,1
557,1,1,12810,157421,10,0
567,1,2,16316,129912,30,0
575,0,0,10735,95975,13,1
591,1,2,27394,132859,18,1

In [140]:
risky =  data[data.TaxableIncome > 30000]
risky

,Undergrad,MaritalStatus,TaxableIncome,CityPopulation,WorkExperience,Urban
0,0,2,68833,50047,10,1
1,1,0,33700,134075,18,1
2,0,1,36925,160205,30,1
3,1,2,50190,193264,15,1
4,0,1,81002,27533,28,0
...,...,...,...,...,...,...
595,1,0,76340,39492,7,1
596,1,0,69967,55369,2,1
597,0,0,47334,154058,0,1
598,1,1,98592,180083,17,0
599,0,0,96519,158137,16,0

In [141]:
fraud = data.drop("CityPopulation",axis=1)

In [142]:
fraud

     Undergrad  MaritalStatus  TaxableIncome  WorkExperience  Urban
0            0              2          68833              10      1
1            1              0          33700              18      1
2            0              1          36925              30      1
3            1              2          50190              15      1
4            0              1          81002              28      0
..         ...            ...            ...             ...    ...
595          1              0          76340               7      1
596          1              0          69967               2      1
597          0              0          47334               0      1
598          1              1          98592              17      0
599          0              0          96519              16      0

[600 rows x 5 columns]

In [143]:
column = fraud["TaxableIncome"]
max_value = column.max()

In [144]:
max_value #iam getting the max value to set the bin range

99619

In [145]:
fraud['TaxableIncome'] = pd.DataFrame(x)
binInterval = [0, 30000,99619 ]
binLabels   = [0,1]
fraud['TaxableIncome'] = pd.cut(fraud['TaxableIncome'], bins = binInterval, labels=binLabels)
#bins (1) > 30000, bins(0) < 30000

In [146]:
fraud["TaxableIncome"] = fraud["TaxableIncome"].fillna(1)

In [147]:
fraud

     Undergrad  MaritalStatus TaxableIncome  WorkExperience  Urban
0            0              2             1              10      1
1            1              0             0              18      1
2            0              1             1              30      1
3            1              2             0              15      1
4            0              1             1              28      0
..         ...            ...           ...             ...    ...
595          1              0             0               7      1
596          1              0             0               2      1
597          0              0             1               0      1
598          1              1             0              17      0
599          0              0             1              16      0

[600 rows x 5 columns]

In [148]:
fraud.dtypes

Undergrad            int32
MaritalStatus        int32
TaxableIncome     category
WorkExperience       int64
Urban                int32
dtype: object

In [149]:
#since tax income is catergorical we will change to float or numeric
fraud['TaxableIncome']=pd.to_numeric(fraud['TaxableIncome'],errors='coerce')

In [150]:
fraud.dtypes

Undergrad         int32
MaritalStatus     int32
TaxableIncome     int64
WorkExperience    int64
Urban             int32
dtype: object

In [151]:
#splitting the data
x = fraud.loc[:,fraud.columns != "TaxableIncome"]
x

     Undergrad  MaritalStatus  WorkExperience  Urban
0            0              2              10      1
1            1              0              18      1
2            0              1              30      1
3            1              2              15      1
4            0              1              28      0
..         ...            ...             ...    ...
595          1              0               7      1
596          1              0               2      1
597          0              0               0      1
598          1              1              17      0
599          0              0              16      0

[600 rows x 4 columns]

In [152]:
y = fraud.iloc[:,2:3]
y

     TaxableIncome
0                1
1                0
2                1
3                0
4                1
..             ...
595              0
596              0
597              1
598              0
599              1

[600 rows x 1 columns]

In [153]:
# Splitting data into training and testing data set
x_train, x_test,y_train,y_test = train_test_split(x,y, test_size=0.2,random_state=40)

In [154]:
#Building Decision Tree Classifier (CART) using Gini Criteria
from sklearn.tree import DecisionTreeClassifier
model_gini = DecisionTreeClassifier(criterion='gini', max_depth=3)

In [155]:
model_gini.fit(x_train, y_train)

DecisionTreeClassifier(max_depth=3)

In [156]:
#Prediction and computing the accuracy
pred=model.predict(x_test)
np.mean(preds==y_test)

ValueError: Unable to coerce to Series, length must be 1: given 120

In [157]:
predictions=preds.reshape(120,1)

In [159]:
np.mean(predictions==y_test)

TaxableIncome    1.0
dtype: float64